//=============================================================================
//
// 3D矩形の衝突判定クラス(collision_rectangle3D.h)
// Author : 唐﨑結斗
// 概要 : 3D矩形の衝突判定生成を行う
//
//=============================================================================
#ifndef _COLLISION_RECTANGLE3D_H_		// このマクロ定義がされてなかったら
#define _COLLISION_RECTANGLE3D_H_		// 二重インクルード防止のマクロ定義

//*****************************************************************************
// インクルード
//*****************************************************************************
#include "collision.h"

//*****************************************************************************
// 前方宣言
//*****************************************************************************
class CLine;

//=============================================================================
// 衝突判定クラス
// Author : 唐﨑結斗
// 概要 : 衝突判定クラス生成を行う
//=============================================================================
class CCollision_Rectangle3D : public CCollision
{
public:
	//--------------------------------------------------------------------
	// 当たった場所の列挙型
	//--------------------------------------------------------------------
	enum EState
	{
		STATE_NONE = 0,		// 無し
		STATE_X,			// X
		STATE_Y,			// Y
		STATE_Z,			// Z
	};

	//--------------------------------------------------------------------
	// 静的メンバ関数
	//--------------------------------------------------------------------
	static CCollision_Rectangle3D *Create();			// インスタンスの生成

	//--------------------------------------------------------------------
	// コンストラクタとデストラクタ
	//--------------------------------------------------------------------
	explicit CCollision_Rectangle3D();
	virtual ~CCollision_Rectangle3D();

	//--------------------------------------------------------------------
	// 純粋仮想関数
	//--------------------------------------------------------------------
	HRESULT Init() override;													// 初期化
	void Uninit() override;														// 終了
	void Update() override;														// 更新
	void Draw() override;														// 描画
	bool Collision(CObject::EObjectType objeType, bool bExtrude) override;		// 当たり判定	
	bool Collision(CObject::EObjectType objeType);								// 当たり判定	
	bool ToRectangle(CCollision *pTarget, bool bExtrude);						// 矩形との当たり判定
	EState GetState() { return m_state; }										// 当たった場所の取得
	bool GetPlusMinus() { return m_bPlusMinus; }								// 正負判定の取得
	void DotCross(CCollision *pTarget);

#ifdef _DEBUG
	void SetLine();					// ラインの設定
#endif // _DEBUG

private:
	//--------------------------------------------------------------------
	// メンバ変数
	//--------------------------------------------------------------------
#ifdef _DEBUG
	CLine **m_pLine;		// ライン情報
	D3DXCOLOR lineCol;		// ラインの色
#endif // _DEBUG
	EState m_state;			// 当たった場所
	bool m_bPlusMinus;		// 正負の判定
};

#endif



