//=============================================================================
//
// 球の衝突判定クラス(collision_sphere.h)
// Author : 唐﨑結斗
// 概要 : 球の衝突判定生成を行う
//
//=============================================================================
#ifndef _COLLISION_SPHERE_H_		// このマクロ定義がされてなかったら
#define _COLLISION_SPHERE_H_		// 二重インクルード防止のマクロ定義

//*****************************************************************************
// インクルード
//*****************************************************************************
#include "collision.h"

//*****************************************************************************
// 前方宣言
//*****************************************************************************
class CModel3D;

//=============================================================================
// 衝突判定クラス
// Author : 唐﨑結斗
// 概要 : 衝突判定クラス生成を行う
//=============================================================================
class CCollision_Sphere : public CCollision
{
public:
	//--------------------------------------------------------------------
	// 静的メンバ関数
	//--------------------------------------------------------------------
	static CCollision_Sphere *Create();			// インスタンスの生成

	//--------------------------------------------------------------------
	// コンストラクタとデストラクタ
	//--------------------------------------------------------------------
	explicit CCollision_Sphere();
	virtual ~CCollision_Sphere();

	//--------------------------------------------------------------------
	// 純粋仮想関数
	//--------------------------------------------------------------------
	HRESULT Init() override;													// 初期化
	void Uninit() override;														// 終了
	void Update() override;														// 更新
	void Draw() override;														// 描画
	bool Collision(CObject::EObjectType objeType, bool bExtrude) override;		// 当たり判定	
	bool ToSphere(CCollision *pTarget, bool bExtrude);							// 球との当たり判定

private:
	//--------------------------------------------------------------------
	// メンバ変数
	//--------------------------------------------------------------------
#ifdef _DEBUG
	CModel3D *m_pModel;		// モデル情報
	D3DXMATRIX m_mtxWorld;	// ワールドマトリックス
#endif // _DEBUG
};

#endif




