//=============================================================================
//
// ゲームクラス(game.h)
// Author : 唐﨑結斗
// 概要 : ゲームクラスの管理を行う
//
//=============================================================================
#ifndef _GAME_H_		// このマクロ定義がされてなかったら
#define _GAME_H_		// 二重インクルード防止のマクロ定義

//*****************************************************************************
// インクルード
//*****************************************************************************
#include "scene_mode.h"

//*****************************************************************************
// 前方宣言
//*****************************************************************************
class CPlayer;
class CMesh3D;
class CScore;
class CTime;

//=============================================================================
// ゲームクラス
// Author : 唐﨑結斗
// 概要 : ゲーム生成を行うクラス
//=============================================================================
class CGame : public CSceneMode
{
public:
	//--------------------------------------------------------------------
	// 静的メンバ関数
	//--------------------------------------------------------------------
	static CPlayer *GetPlayer() { return m_pPlayer; }				// プレイヤー
	static CScore *GetScore() { return m_pScore; }					// スコア
	static CTime *GetTime() { return m_pTime; }						// タイム
	static void SetGame(const bool bGame) { m_bGame = bGame; }		// ゲームの状況の設定

	//--------------------------------------------------------------------
	// コンストラクタとデストラクタ
	//--------------------------------------------------------------------
	CGame();
	~CGame() override;

	//--------------------------------------------------------------------
	// 静的メンバ変数
	//--------------------------------------------------------------------
	static CPlayer *m_pPlayer;						// プレイヤークラス
	static CScore *m_pScore;						// スコア
	static CTime *m_pTime;							// タイム
	static D3DXCOLOR fogColor;						// フォグカラー
	static float fFogStartPos;						// フォグの開始点
	static float fFogEndPos;						// フォグの終了点
	static float fFogDensity;						// フォグの密度
	static bool m_bGame;							// ゲームの状況

	//--------------------------------------------------------------------
	// メンバ関数
	//--------------------------------------------------------------------
	HRESULT Init() override;					// 初期化
	void Uninit() override;						// 終了
	void Update() override;						// 更新
	void Draw() override;						// 描画
};

#endif



