//=============================================================================
//
// 入力処理(input.cpp)
// Author : 唐﨑結斗
// 概要 : オブジェクト生成を行う
//
//=============================================================================

//***************************************************************************
// インクルード
//***************************************************************************
#include <assert.h>
#include <stdio.h>

#include "input.h"

//=============================================================================
// コンストラクタ
// Author : 唐﨑結斗
// 概要 : インスタンス生成時に行う処理
//=============================================================================
CInput::CInput()
{
	m_pInput = nullptr;
	m_pDevice = nullptr;
}

//=============================================================================
// デストラクタ
// Author : 唐﨑結斗
// 概要 : インスタンス終了時に行う処理
//=============================================================================
CInput::~CInput()
{

}

//=============================================================================
// 終了
// Author : 唐﨑結斗
// 概要 : キーボードのアクセス権を解放し、デバイスとオブジェクトを解放する
//=============================================================================
void CInput::Uninit(void)
{
	// 入力デバイスの解放
	if (m_pDevice != nullptr)
	{
		m_pDevice->Unacquire();	// キーボードのアクセス権を破棄
		m_pDevice->Release();
		m_pDevice = nullptr;
	}

	// DirectInputオブジェクトの解放
	if (m_pInput != nullptr)
	{
		m_pInput->Release();
		m_pInput = nullptr;
	}
}
