//=============================================================================
//
// 2Dナンバー(explosion2D.cpp)
// Author : 唐﨑結斗
// 概要 : 2Dナンバー生成を行う
//
//=============================================================================

//*****************************************************************************
// インクルード
//*****************************************************************************
#include <assert.h>

#include "number.h"
#include "renderer.h"
#include "application.h"

//=============================================================================
// インスタンス生成
// Author : 唐﨑結斗
// 概要 : 2Dバレットを生成する
//=============================================================================
CNumber * CNumber::Create()
{
	// オブジェクトインスタンス
	CNumber *pNumber = nullptr;

	pNumber = new CNumber;

	// メモリの確保ができなかった
	assert(pNumber != nullptr);

	// 数値の初期化
	pNumber->Init();

	// インスタンスを返す
	return pNumber;
}

//=============================================================================
// コンストラクタ
// Author : 唐﨑結斗
// 概要 : インスタンス生成時に行う処理
//=============================================================================
CNumber::CNumber(int nPriority) : CObject2D(nPriority)
{
	m_nNumber = 0;
}

//=============================================================================
// デストラクタ
// Author : 唐﨑結斗
// 概要 : インスタンス終了時に行う処理
//=============================================================================
CNumber::~CNumber()
{

}

//=============================================================================
// 初期化
// Author : 唐﨑結斗
// 概要 : テクスチャの設定し、メンバ変数の初期値を設定
//=============================================================================
HRESULT CNumber::Init()
{
	// オブジェクト2Dの初期化
	CObject2D::Init();

	// テクスチャの設定
	LoadTex(6);

	// テクスチャ座標の設定
	SetTex(D3DXVECTOR2(0.0f, 0.0f), D3DXVECTOR2(1.0f / 10, 1.0f));

	return S_OK;
}

//=============================================================================
// 終了
// Author : 唐﨑結斗
// 概要 : テクスチャのポインタと頂点バッファの解放
//=============================================================================
void CNumber::Uninit()
{// オブジェクト2Dの終了
	CObject2D::Uninit();
}

//=============================================================================
// 更新
// Author : 唐﨑結斗
// 概要 : 2D更新を行う
//=============================================================================
void CNumber::Update()
{
	// オブジェクト2Dの更新
	CObject2D::Update();
}

//=============================================================================
// 描画
// Author : 唐﨑結斗
// 概要 : 2D描画を行う
//=============================================================================
void CNumber::Draw()
{// プレイヤー2Dの描画
	CObject2D::Draw();
}

//=============================================================================
// ナンバーの設定
// Author : 唐﨑結斗
// 概要 : ナンバーを設定し対応するテクスチャ座標を設定
//=============================================================================
void CNumber::SetNumber(int nNumber)
{
	// 数値の設定
	m_nNumber = nNumber;

	// テクスチャ座標の1桁分の数値の設定
	float fTexX = 1.0f / 10;

	// テクスチャ座標の設定
	SetTex(D3DXVECTOR2(0.0f + fTexX * m_nNumber, 0.0f), D3DXVECTOR2(fTexX + fTexX * m_nNumber, 1.0f));
}


