//=============================================================================
//
// スフィアクラス(sphere.h)
// Author : 唐﨑結斗
// 概要 : オブジェクト生成を行う
//
//=============================================================================
#ifndef _SPHERE_H_		// このマクロ定義がされてなかったら
#define _SPHERE_H_		// 二重インクルード防止のマクロ定義

//*****************************************************************************
// インクルード
//*****************************************************************************
#include "mesh.h"
#include "texture.h"

//=============================================================================
// スフィアクラス
// Author : 唐﨑結斗
// 概要 : スフィア生成を行うクラス
//=============================================================================
class CSphere : public CMesh3D
{
public:
	//--------------------------------------------------------------------
	// 静的メンバ関数
	//--------------------------------------------------------------------
	static CSphere *Create(void);				// スフィアの生成

	//--------------------------------------------------------------------
	// コンストラクタとデストラクタ
	//--------------------------------------------------------------------
	CSphere();
	~CSphere();

	//--------------------------------------------------------------------
	// メンバ関数
	//--------------------------------------------------------------------
	HRESULT Init() override;										// 初期化
	void Uninit() override;											// 終了
	void Update() override;											// 更新
	void Draw() override;											// 描画
	void SetVtx() override;											// 頂点座標などの設定
	void SetTex() override;
	void SetRadius(float fRadius);									// 半径の取得
	void SetSphereRange(D3DXVECTOR2 sphereRange);					// 球の描画範囲の取得

private:
	//--------------------------------------------------------------------
	// メンバ変数
	//--------------------------------------------------------------------
	D3DXVECTOR2		m_sphereRange;		// 球の描画範囲
	float			m_fRadius;			// 半径
};

#endif



