//=============================================================================
//
// チュートリアルクラス(tutorial.h)
// Author : 唐﨑結斗
// 概要 : チュートリアルクラスの管理を行う
//
//=============================================================================
#ifndef _TUTORIAL_H_		// このマクロ定義がされてなかったら
#define _TUTORIAL_H_		// 二重インクルード防止のマクロ定義

//*****************************************************************************
// インクルード
//*****************************************************************************
#include "scene_mode.h"

//*****************************************************************************
// 前方宣言
//*****************************************************************************
class CPlayer;
class CMesh3D;
class CScore;
class CObject2D;

//=============================================================================
// ゲームクラス
// Author : 唐﨑結斗
// 概要 : ゲーム生成を行うクラス
//=============================================================================
class CTutorial : public CSceneMode
{
public:
	//--------------------------------------------------------------------
	// 静的メンバ関数
	//--------------------------------------------------------------------
	static CPlayer *GetPlayer() { return m_pPlayer; }							// プレイヤー
	static CScore *GetScore() { return m_pScore; }								// スコア

	//--------------------------------------------------------------------
	// コンストラクタとデストラクタ
	//--------------------------------------------------------------------
	CTutorial();
	~CTutorial() override;

	//--------------------------------------------------------------------
	// 静的メンバ変数
	//--------------------------------------------------------------------
	static CPlayer *m_pPlayer;						// プレイヤークラス
	static CScore *m_pScore;						// スコア
	static D3DXCOLOR fogColor;						// フォグカラー
	static float fFogStartPos;						// フォグの開始点
	static float fFogEndPos;						// フォグの終了点
	static float fFogDensity;						// フォグの密度

	//--------------------------------------------------------------------
	// メンバ関数
	//--------------------------------------------------------------------
	HRESULT Init() override;												// 初期化
	void Uninit() override;													// 終了
	void Update() override;													// 更新
	void Draw() override;													// 描画
	void SetTutoItem(bool bTutoItem);

private:
	//--------------------------------------------------------------------
	// メンバ変数
	//--------------------------------------------------------------------
	CObject2D *m_pTutorial;			// チュートリアルオブジェクト
	CObject2D *m_pTutorialEnd;
	int m_nCntFrame;			
	bool m_bTutoItem;
};

#endif




